import style from "./adminNav.module.css"

export default function AdminSideRequest() {
    return (
        <nav className={style.bartools}>
            <ul className={style.items_tools}>
                <li className={style.list_item}>
                    <a href="">
                        <i className={`bx  bx-check-circle ${style.icon}`}></i> 
                        <span className={style.titlebtn}>Принять</span>
                        <span className={style.titlebtn}>выбранное</span>
                    </a>
                </li>
                <li className={style.list_item}>
                    <a href="">
      
                        <svg className={`${style.icon}`} viewBox="0 0 30 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.39 11.0192L8.90129 5.00778C8.85839 4.9326 8.80122 4.86716 8.73321 4.8154C8.6652 4.76364 8.58776 4.72663 8.50556 4.7066C8.42335 4.68657 8.33806 4.68393 8.25484 4.69884C8.17162 4.71375 8.09218 4.74591 8.02129 4.79337C6.4412 5.88913 5.12459 7.34383 4.17218 9.04619C3.21976 10.7486 2.65678 12.6535 2.52629 14.6152C2.52243 14.7025 2.53558 14.7896 2.56494 14.8716C2.5943 14.9535 2.63929 15.0285 2.69723 15.0921C2.75518 15.1557 2.82489 15.2066 2.90225 15.2418C2.9796 15.2771 3.06302 15.2959 3.14754 15.2972L9.92379 15.4134C9.93884 14.5246 10.1733 13.6545 10.6049 12.8855C11.0365 12.1165 11.6509 11.4741 12.39 11.0192ZM22.5263 5.19378C22.4554 5.14072 22.3745 5.10351 22.2889 5.08454C22.2033 5.06557 22.1148 5.06525 22.029 5.08361C21.9433 5.10196 21.8622 5.13858 21.7909 5.19113C21.7196 5.24368 21.6597 5.31101 21.615 5.38883L18.1238 11.4054C18.7157 11.884 19.1965 12.4934 19.5308 13.189C19.8652 13.8845 20.0448 14.6485 20.0563 15.4251L26.83 15.3088C26.9149 15.3075 26.9986 15.2886 27.0763 15.2533C27.154 15.2179 27.2239 15.1668 27.2821 15.1029C27.3403 15.0391 27.3855 14.9638 27.415 14.8816C27.4444 14.7994 27.4577 14.7118 27.4538 14.6242C27.3346 12.7792 26.8329 10.9823 25.9828 9.35515C25.1326 7.72805 23.9538 6.30885 22.5263 5.19378ZM17.4425 20.0622C16.6949 20.5021 15.8504 20.7361 14.99 20.7416C14.1293 20.7362 13.2843 20.5023 12.5363 20.0622L9.23379 26.204C9.19214 26.2798 9.16576 26.3636 9.15626 26.4502C9.14675 26.5368 9.15432 26.6245 9.17849 26.708C9.20267 26.7916 9.24296 26.8691 9.29693 26.9361C9.3509 27.0031 9.41744 27.0582 9.49254 27.0979C11.203 27.967 13.0839 28.4183 14.99 28.4167C16.8953 28.4182 18.7755 27.967 20.485 27.0979C20.5601 27.0582 20.6267 27.0031 20.6807 26.9361C20.7346 26.8691 20.7749 26.7916 20.7991 26.708C20.8233 26.6245 20.8308 26.5368 20.8213 26.4502C20.8118 26.3636 20.7854 26.2798 20.7438 26.204L17.4425 20.0622Z" fill="white"/>
                            <path d="M15 19.375C17.0711 19.375 18.75 17.6401 18.75 15.5C18.75 13.3599 17.0711 11.625 15 11.625C12.9289 11.625 11.25 13.3599 11.25 15.5C11.25 17.6401 12.9289 19.375 15 19.375Z" fill="white"/>
                        </svg>

                        <span className={style.titlebtn}>Отклонить</span>
                        <span className={style.titlebtn}>выбранное</span>
                    </a>
                </li>
                <li className={style.list_item}>
                    <a href="">
                        < i className={`bx  bx-trash-alt ${style.icon}`}  ></i>  
                        <span className={style.titlebtn}>Удалить</span>
                        <span className={style.titlebtn}>выбранное</span>
                    </a>
                </li>
            </ul>
            <ul className={style.pages}>
                <li className={style.pages_item}>
                    <a href="" className={`${style.nav_link} ${style.disable}`}>
                        < i className='bx  bx-chevron-left'  ></i> 
                    </a>
                </li>
                <li className={style.pages_title}>
                    1 из 1
                </li>
                <li className={style.pages_item}>
                    <a href="" className={style.nav_link}>
                        < i className='bx  bx-chevron-right'  ></i> 
                    </a>
                </li>
                        
            </ul>
        </nav>
    );
}